OpenFOAM-4.x-master/tutorials/lagrangian/reactingParcelFilmFoam/cylinder/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

application=`getApplication`

runApplication $application
